const Mock = require("mockjs");
const fs = require('fs')


const list = Mock.mock({

    "list|100": [{
        "name": "@ctitle(5,10)",
        "ditie|1": ['10号线(基隆路-虹桥火车站)',
            '10号线(基隆路-航中路)',
            '15号线',
            '1B号线',
            '1号线',
            '2号线',
            '3号线',
            '4号线',
            '5号线',
            '南延伸段5号线',
            '5号线',
            '支线',
            '6号线',
            '7号线',
            '8号线',
            '9号线',
            '11号线(花桥-三林)',
            '10号线(新江湾域-虹桥火车站)',
            '10号线(新江湾城-航中路)',
            '10号线(二期)',
            '11号线(嘉定北-迪士尼)',
            '11号线(花桥-迪士尼)',
            '12号线',
            '13号线',
            '16号线',
            '17号线',
            '浦江线',
            '金山铁路磁悬浮'
        ],
        "quyu|1": ['浦东',
            '闵行',
            '宝山',
            '徐汇',
            '普陀',
            '杨浦',
            '长宁',
            '松江',
            '嘉定',
            '黄浦',
            '静安',
            '虹口',
            '青浦',
            '奉贤',
            '金山',
            '崇明'
        ],
        "jiage|20-2000": 1,
        "fangxing|1": ["一室", "二室", "三室", "四室", "五室", "五室以上"],
        "mianji|20-200": 1,
        "ts|1": ["必看好房", "满五年", "满两年", "VR房源", "7日新上", "随时看房"],
        "cx|1": ["南北", "朝南", "朝东", "朝北", "朝西"],
        "ll|1-30": 1,
        "zx|1": ["精装房", "普通装修", "毛坯房"],
        "yt|1": ["普通住宅", "商业类", "别墅", "四合院", "车位", "其他"],
        "qs|1": ["商品房", "经适房", "公房", "其他"],
        "dt|1": ["有电梯", "无电梯"],
        "lx|1": ["塔楼", "板楼", "板塔结合"],
        "xq|1": ["多福多寿小区", "豆腐干小区", "时代小区", "大风小区", "如图小区", "凤凰小区", "湖南小区", "国防小区", "东莞小区", "阳台小区", "高富小区", ],
        id: "@id",
        "img|1": ["https://i02piccdn.sogoucdn.com/651149bea078d610", "https://file103.mafengwo.net/s9/M00/D0/97/wKgBs1dz--KABrtuAAC3AQ1sMFc93.jpeg?imageMogr2/thumbnail/%211070x804r/gravity/Center/crop/%211070x804/quality/90",
            "https://img4.cache.netease.com/photo/0025/2017-04-18/CI9ODQRG0BGT0025.jpg", "http://tgi1.jia.com/109/960/9960506.jpg", "http://pic.to8to.com/case/1810/25/20181025_165f87c875db89ef270eeql26zzuck9i.jpg",
            "https://img.mp.itc.cn/upload/20170316/f5f45de144e34253b9ae8087c8610c8c_th.jpg"
        ]

    }]
})


fs.writeFileSync('list.json', JSON.stringify(list));